[
  {
    "id": 1,
    "userId": 1,
    "imageUrl": "https://m.cricbuzz.com/a/img/v1/192x192/i1/c171004/sachin-tendulkar.jpg",
    "description": "In 2010, Time magazine included Sachin in its annual Time 100 list as one of the Most Influential People in the World. In December 2012, Tendulkar announced his retirement from ODIs. He retired from Twenty20 cricket in October 2013 and subsequently retired from all forms of cricket on 16 November 2013 after playing his 200th Test match, against the West Indies in Mumbai's Wankhede Stadium. Tendulkar played 664 international cricket matches in total, scoring 34,357 runs.",
    "likes": 10,
    "comments": 5
  },
  {
    "id": 2,
    "userId": 1,
    "imageUrl": "https://images.outlookindia.com/public/uploads/articles/2020/5/13/Kohli-Sachin_571_855.jpg",
    "description": "In 1992, at the age of 19, Tendulkar became the first overseas-born player to represent Yorkshire, which prior to Tendulkar joining the team, never selected players even from other English counties. Selected for Yorkshire as a replacement for the injured Australian fast bowler Craig McDermott, Tendulkar played 16 first-class matches for the county and scored 1070 runs at an average of 46.52.",
    "likes": 6,
    "comments": 2
  },
  {
    "id": 3,
    "userId": 1,
    "imageUrl": "https://img.etimg.com/thumb/msid-72033478,width-643,imgsize-222096,resizemode-4/sachin-tendulkar.jpg",
    "description": "He looked the embodiment of India's famous opener, Gavaskar, and indeed was wearing a pair of his pads. While he displayed a full repertoire of strokes in compiling his maiden Test hundred, most remarkable were his off-side shots from the back foot. Though only 5ft 5in tall, he was still able to control without difficulty short deliveries from the English pacemen.",
    "likes": 0,
    "comments": 1
  },
  {
    "id": 4,
    "userId": 1,
    "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRj_SKztFsShoLlp3OnQSPPQ4IPu0--VTc8KGNUpDWXL4XxBzdt&s",
    "description": "Tendulkar further enhanced his reputation as a future great during the 1991–92 tour of Australia held before the 1992 Cricket World Cup, that included an unbeaten 148 in the third Test at Sydney, making him the youngest batsman to score a century in Australia. He then scored 114 on a fast, bouncing pitch in the final Test at Perth against a pace attack comprising Merv Hughes, Bruce Reid and Craig McDermott. Hughes commented to Allan Border at the time that This little prick's going to get more runs than you, AB.",
    "likes": 100,
    "comments": 5
  },
  {
    "id": 5,
    "userId": 1,
    "imageUrl": "https://st2.cricketcountry.com/wp-content/uploads/cricket/image_20121226091513.jpg",
    "description": "Tendulkar's rise continued when he was the leading run scorer at the 1996 World Cup, scoring two centuries. He was the only Indian batsman to perform well in the semi-final against Sri Lanka. Tendulkar fell amid a batting collapse and the match referee, Clive Lloyd, awarded Sri Lanka the match after the crowd began rioting and throwing litter onto the field.",
    "likes": 10,
    "comments": 1
  },
  {
    "id": 6,
    "userId": 1,
    "imageUrl": "https://cdn.wisden.com/wp-content/uploads/2020/06/GettyImages-630835970-e1592477771804-680x383.jpg",
    "description": "In the 2002 series in the West Indies, Tendulkar started well, scoring 79 in the first Test. In the second Test at Port of Spain, Sachin Tendulkar scored 117 in the first innings, his 29th Test century in his 93rd Test match, to equal Sir Donald Bradman's record of 29 Test hundreds. He was awarded by Sports car Ferrari by Michael Schumacher for achieving this feat",
    "likes": 200,
    "comments": 1
  },
  {
    "id": 7,
    "userId": 1,
    "imageUrl": "https://gumlet.assettype.com/nationalherald%2F2018-04%2F516cafc2-6bbe-441c-baef-608d8b2e4a76%2Fthat_time_when_i_lied_to_watch_sachin_tendulkar_play.jpg?rect=0%2C0%2C800%2C450&auto=format%2Ccompress&w=1200",
    "description": "Then, in a hitherto unprecedented sequence, he scored 0, 0, 8 and 0 in the next four innings. He returned to form in the last Test scoring 41 and 86, one half century. However, India lost the series. In this period, in the third Test match against England in August 2002, Sachin scored his 30th Test century to surpass Bradman's haul, in his 99th Test match",
    "likes": 4,
    "comments": 1
  },
  {
    "id": 8,
    "userId": 1,
    "imageUrl": "https://c.ndtvimg.com/2020-05/buqj4cr8_sachin-tendulkar-virat-kohli_625x300_31_May_20.jpg",
    "description": "Tendulkar made 673 runs in 11 matches in the 2003 Cricket World Cup, helping India reach the final. While Australia retained the trophy that they had won in 1999, Tendulkar was given the Man of the Tournament award. He continued to score heavily in ODI cricket that year, with two hundreds in a tri-series involving New Zealand and Australia. As a part-time bowler, he dismissed an exhausted centurion, Matthew Hayden in the tri-series final",
    "likes": 100,
    "comments": 1
  },
  {
    "id": 9,
    "userId": 1,
    "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn%3AANd9GcR7tOOADSIHhTlMZAekBYY7POhFlJFc8WW1iaBtm1z0QJn_m74Q&usqp=CAU",
    "description": "A tennis elbow injury then took its toll on Tendulkar, leaving him out of the side for most of the year, coming back only for the last two Tests when Australia toured India in 2004. He played a part in India's victory in Mumbai in that series with a fast 55, though Australia took the series 2–1",
    "likes": 10,
    "comments": 1
  },
  {
    "id": 10,
    "userId": 1,
    "imageUrl": "https://c.ndtvimg.com/2020-04/t3ekkeko_virat-kohli-instagram_625x300_21_April_20.jpg",
    "description": "Tendulkar's comeback came in the DLF cup in Malaysia and he was the only Indian batsman to shine. In his comeback match, against West Indies on 14 September 2006, Tendulkar responded to his critics who believed that his career was inexorably sliding with his 40th ODI century. Though he scored 141 not out, West Indies won the rain-affected match by the D/L method.",
    "likes": 200,
    "comments": 1
  },
  {
    "id": 11,
    "userId": 1,
    "imageUrl": "https://cdn.telanganatoday.com/wp-content/uploads/2020/04/Virat-Kohli-says-he-will-no.jpg",
    "description": "In the subsequent Test series against Bangladesh, Tendulkar returned to his opening slot and was chosen as the Man of the Series. He continued by scoring 99 and 93 in the first two matches of the Future Cup against South Africa. During the second match, he also became the first to score 15,000 runs in ODIs. He was the leading run scorer and was adjudged the Man of the Series",
    "likes": 4,
    "comments": 1
  },
  {
    "id": 12,
    "userId": 1,
    "imageUrl": "https://cricketaddictor.com/wp-content/uploads/2019/09/37209-e1573556871489.jpg",
    "description": "Before the Indian cricket team's tour of Sri Lanka in July 2008, Tendulkar needed 177 runs to go past Brian Lara's record of Test 11,953 runs. However, he failed in all six innings, scoring a total of 95 runs. India lost the series and his average of 15.83 was his worst in a Test series with at least three matches",
    "likes": 100,
    "comments": 1
  }
]
